import 'package:nitnem/pages/path_details.dart';


//  this class will contain all the text to be displayed in Japji Sahib
class JaapSahibPageReference{

  // creating a private variable called _checkPageNumber to keep the reference
  // of each page number of the path
  int _checkPageNumber = 0;

  // The list created below is used to display the content according to
  // the pages
  // the list below is a private list
  List<PathDetails> _pageList = [
    PathDetails(
      text: '''
स्री वाहिगुरू जी की फ़तह ॥
जापु ॥
स्री मुखवाक पातिसाही १० ॥
छपै छंद ॥ त्वप्रसादि ॥
च्क्र चिहन अरु बरन जाति अरु पाति नहिन जिह ॥
रूप रंग अरु रेख भेख कोऊ कहि न सकति किह ॥
अचल मूरति अनभउ प्रकास अमितोजि कहिजै ॥
कोटि इंद्र इंद्राणि साहु साहाणि गणिजै ॥
त्रिभवण महीप सुर नर असुर नेति नेति बन त्रिण कहत ॥
त्व सरब नाम कथै कवन करम नाम बरणत सुमति ॥१॥
      ''',
      pageNumber: 0,
    ),

    PathDetails(
      text: '''
भुजंग प्रयात छंद ॥
नमसत्वं अकाले ॥
नमसत्वं क्रिपाले ॥
नमसत्वं अरूपे ॥
नमसत्वं अनूपे ॥२॥

नमसतं अभेखे ॥
नमसतं अलेखे ॥
नमसतं अकाए ॥
नमसतं अजाए ॥३॥

नमसतं अगंजे ॥
नमसतं अभंजे ॥
नमसतं अनामे ॥
नमसतं अठामे ॥४॥

नमसतं अकरमं ॥
नमसतं अधरमं ॥
नमसतं अनामं ॥
नमसतं अधामं ॥५॥
      ''',
      pageNumber: 1,
    ),

    PathDetails(
      text:'''
नमसतं अजीते ॥
नमसतं अभीते ॥
नमसतं अबाहे ॥
नमसतं अढाहे ॥६॥

नमसतं अनीले ॥
नमसतं अनादे ॥
नमसतं अछेदे ॥
नमसतं अगाधे ॥७॥

नमसतं अगंजे ॥
नमसतं अभंजे ॥
नमसतं उदारे ॥
नमसतं अपारे ॥८॥

नमसतं सु एकै ॥
नमसतं अनेकै ॥
नमसतं अभूते ॥
नमसतं अजूपे ॥९॥
      ''',
      pageNumber: 2,
    ),

    PathDetails(
      text: '''
नमसतं अगंजे ॥
नमसतं अभंजे ॥
नमसतं उदारे ॥
नमसतं अपारे ॥८॥

नमसतं सु एकै ॥
नमसतं अनेकै ॥
नमसतं अभूते ॥
नमसतं अजूपे ॥९॥

नमसतं न्रिधूते ॥
नमसतं अभूते ॥
नमसतं अलोके ॥
नमसतं असोके ॥१२॥

नमसतं न्रितापे ॥
नमसतं अथापे ॥
नमसतं त्रिमाने ॥
नमसतं निधाने ॥१३॥
      ''',
      pageNumber: 3,
    ),

    PathDetails(
      text: '''
नमसतं अगाहे ॥
नमसतं अबाहे ॥
नमसतं त्रिबरगे ॥
नमसतं असरगे ॥१४॥

नमसतं प्रभोगे ॥
नमसतं सुजोगे ॥
नमसतं अरंगे ॥
नमसतं अभंगे ॥१५॥

नमसतं अगमे ॥
नमसतसतु रमे ॥
नमसतं जलासरे ॥
नमसतं निरासरे ॥१६॥

नमसतं अजाते ॥
नमसतं अपाते ॥
नमसतं अमजबे ॥
नमसतसतु अजबे ॥१७॥
      ''',
      pageNumber: 4,
    ),

    PathDetails(
      text: '''
नमसतं अभेसे ॥
नमसतं न्रिधामे ॥
नमसतं न्रिबामे ॥१८॥

नमो सरब काले ॥
नमो सरब दिआले ॥
नमो सरब रूपे ॥
नमो सरब भूपे ॥१९॥

नमो सरब खापे ॥
नमो सरब थापे ॥
नमो सरब काले ॥
नमो सरब पाले ॥२०॥

नमसतसतु देवै ॥
नमसतं अभेवै ॥
नमसतं अजनमे ॥
नमसतं सुबनमे ॥२१॥
      ''',
      pageNumber: 5,
    ),

    PathDetails(
      text: '''
नमो सरब गउने ॥
नमो सरब भउने ॥
नमो सरब रंगे ॥
नमो सरब भंगे ॥२२॥

नमो काल काले ॥
नमसतसतु दिआले ॥
नमसतं अबरने ॥
नमसतं अमरने ॥२३॥

नमसतं जरारं ॥
नमसतं क्रितारं ॥
नमो सरब धंधे ॥
नमो सत अबंधे ॥२४॥

नमसतं न्रिसाके ॥
नमसतं न्रिबाके ॥
नमसतं रहीमे ॥
नमसतं करीमे ॥२५॥
      ''',
      pageNumber: 6,
    ),

    PathDetails(
      text: '''
नमसतं अनंते ॥
नमसतं महंते ॥
नमसतसतु रागे ॥
नमसतं सुहागे ॥२६॥

नमो सरब सोखं ॥
नमो सरब पोखं ॥
नमो सरब करता ॥
नमो सरब हरता ॥२७॥

नमो जोग जोगे ॥
नमो भोग भोगे ॥
नमो सरब दिआले ॥
नमो सरब पाले ॥२८॥

चाचरी छंद ॥ त्वप्रसादि ॥
अरूप हैं ॥
अनूप हैं ॥
अजू हैं ॥
अभू हैं ॥२९॥
      ''',
      pageNumber: 7,
    ),

    PathDetails(
      text: '''
अलेख हैं ॥
अभेख हैं ॥
अनाम हैं ॥
अकाम हैं ॥३०॥

अधे हैं ॥
अभे हैं ॥
अजीत हैं ॥
अभीत हैं ॥३१॥

त्रिमान हैं ॥
निधान हैं ॥
त्रिबरग है ॥
असरग हैं ॥३२॥

अनील हैं ॥
अनादि हैं ॥
अजे हैं ॥
अजादि हैं ॥३३॥
      ''',
      pageNumber: 8,
    ),

    PathDetails(
      text: '''
अजनम हैं ॥
अबरन हैं ॥
अभूत हैं ॥
अभरन हैं ॥३४॥

अगंज हैं ॥
अभंज हैं ॥
अझूझ हैं ॥
अझंझ हैं ॥३५॥

अमीक हैं ॥
रफ़ीक हैं ॥
अधंध हैं ॥
अबंध हैं ॥३६॥

न्रिबूझ हैं ॥
असूझ हैं ॥
अकाल हैं ॥
अजाल हैं ॥३७॥
      ''',
      pageNumber: 9,
    ),

    PathDetails(
      text: '''
अलाह हैं ॥
अजाह हैं ॥
अनंत हैं ॥
महंत हैं ॥३८॥

अलीक हैं ॥
न्रिस्रीक हैं ॥
न्रिल्मभ हैं ॥
अस्मभ हैं ॥३९॥

अगम हैं ॥
अजम हैं ॥
अभूत हैं ॥
अछूत हैं ॥४०॥

अलोक हैं ॥
असोक हैं ॥
अकरम हैं ॥
अभरम हैं ॥४१॥
      ''',
      pageNumber: 10,
    ),

    PathDetails(
      text: '''
अजीत हैं ॥
अभीत हैं ॥
अबाह हैं ॥
अगाह हैं ॥४२॥

अमान हैं ॥
निधान हैं ॥
अनेक हैं ॥
फिरि एक हैं ॥४३॥

भुजंग प्रयात छंद ॥
नमो सरब माने ॥
समसती निधाने ॥
नमो देव देवे ॥
अभेखी अभेवे ॥४४॥

नमो काल काले ॥
नमो सरब पाले ॥
नमो सरब गउणे ॥
नमो सरब भउणे ॥४५॥
      ''',
      pageNumber: 11,
    ),

    PathDetails(
      text: '''
अनंगी अनाथे ॥
न्रिसंगी प्रमाथे ॥
नमो भान भाने ॥
नमो मान माने ॥४६॥

नमो चंद्र चंद्रे ॥
नमो भान भाने ॥
नमो गीत गीते ॥
नमो तान ताने ॥४७॥

नमो न्रि्त नि्रते ॥
नमो नाद नादे ॥
नमो पान पाने ॥
नमो बाद बादे ॥४८॥

अनंगी अनामे ॥
समसती सरूपे ॥
प्रभंगी प्रमाथे ॥
समसती बिभूते ॥४९॥
      ''',
      pageNumber: 12,
    ),

    PathDetails(
      text: '''
कलंकं बिना नेकलंकी सरूपे ॥
नमो राज राजेस्वरं परम रूपे ॥५०॥

नमो जोग जोगेस्वरं परम सि्धे ॥
नमो राज राजेस्वरं परम ब्रिधे ॥५१॥

नमो ससत्र पाणे ॥
नमो असत्र माणे ॥
नमो परम गिआता ॥
नमो लोक माता ॥५२॥

अभेखी अभरमी अभोगी अभुगते ॥
नमो जोग जोगेस्वरं परम जुगते ॥५३॥
      ''',
      pageNumber: 13,
    ),

    PathDetails(
      text: '''
नमो नि्त नाराइणे करूर करमे ॥
नमो प्रेत अप्रेत देवे सुधरमे ॥५४॥

नमो रोग हरता ॥
नमो राग रूपे ॥
नमो साह साहं ॥
नमो भूप भूपे ॥५५॥

नमो दान दाने ॥
नमो मान माने ॥
नमो रोग रोगे ॥
नमसतं सनाने ॥५६॥

नमो मंत्र मंत्रं ॥
नमो जंत्र जंत्रं ॥
नमो इसट इसटे ॥
नमो तंत्र तंत्रं ॥५७॥
      ''',
      pageNumber: 14,
    ),

    PathDetails(
      text: '''
सदा स्चदानंद सरबं प्रणासी ॥
अनूपे अरूपे समसतुल निवासी ॥५८॥

सदा सिधिदा बुधिदा ब्रिधि करता ॥
अधो उरध अरधं अघं ओघ हरता ॥५९॥

परं परम परमेस्वरं प्रोछ पालं ॥
सदा सरबदा सिधि दाता दिआलं ॥६०॥

अछेदी अभेदी अनामं अकामं ॥
समसतो पराजी समसतसतु धामं ॥६१॥
      ''',
      pageNumber: 15,
    ),

    PathDetails(
      text: '''
तेरा जोरु ॥
चाचरी छंद ॥
जले हैं ॥
थले हैं ॥
अभीत हैं ॥
अभे हैं ॥६२॥

प्रभू हैं ॥
अजू हैं ॥
अदेस हैं ॥
अभेस हैं ॥६३॥

भुजंग प्रयात छंद ॥
अगाधे अबाधे ॥
अनंदी सरूपे ॥
नमो सरब माने ॥
समसती निधाने ॥६४॥
      ''',
      pageNumber: 16,
    ),

    PathDetails(
      text: '''
नमसत्वं न्रिनाथे ॥
नमसत्वं प्रमाथे ॥
नमसत्वं अगंजे ॥
नमसत्वं अभंजे ॥६५॥

नमसत्वं अकाले ॥
नमसत्वं अपाले ॥
नमो सरब देसे ॥
नमो सरब भेसे ॥६६॥

नमो राज राजे ॥
नमो साज साजे ॥
नमो साह साहे ॥
नमो माह माहे ॥६७॥

नमो गीत गीते ॥
नमो प्रीति प्रीते ॥
नमो रोख रोखे ॥
नमो सोख सोखे ॥६८॥
      ''',
      pageNumber: 17,
    ),

    PathDetails(
      text: '''
नमसत्वं अकाले ॥
नमसत्वं अपाले ॥
नमो सरब देसे ॥
नमो सरब भेसे ॥६६॥

नमो राज राजे ॥
नमो साज साजे ॥
नमो साह साहे ॥
नमो माह माहे ॥६७॥

नमो गीत गीते ॥
नमो प्रीति प्रीते ॥
नमो रोख रोखे ॥
नमो सोख सोखे ॥६८॥

नमो सरब रोगे ॥
नमो सरब भोगे ॥
नमो सरब जीतं ॥
नमो सरब भीतं ॥६९॥
      ''',
      pageNumber: 18,
    ),

    PathDetails(
      text: '''
नमो सरब गिआनं ॥
नमो परम तानं ॥
नमो सरब मंत्रं ॥
नमो सरब जंत्रं ॥७०॥

नमो सरब द्रि्सं ॥
नमो सरब क्रि्सं ॥
नमो सरब रंगे ॥
त्रिभंगी अनंगे ॥७१॥

नमो जीव जीवं ॥
नमो बीज बीजे ॥
अखि्जे अभि्जे ॥
समसतं प्रसि्जे ॥७२॥

क्रिपालं सरूपे ॥
कुकरमं प्रणासी ॥
सदा सरबदा रिधि सिधं निवासी ॥७३॥
      ''',
      pageNumber: 19,
    ),

    PathDetails(
      text: '''
चरपट छंद ॥ त्वप्रसादि ॥
अम्रित करमे ॥
अमब्रित धरमे ॥
अखिल जोगे ॥
अचल भोगे ॥७४॥

अचल राजे ॥
अटल साजे ॥
अखल धरमं ॥
अलख करमं ॥७५॥

सरबं दाता ॥
सरबं गिआता ॥
सरबं भाने ॥
सरबं माने ॥७६॥

सरबं प्राणं ॥
सरबं त्राणं ॥
सरबं भुगता ॥
सरबं जुगता ॥७७॥
      ''',
      pageNumber: 20,
    ),

    PathDetails(
      text: '''
सरबं देवं ॥
सरबं भेवं ॥
सरबं काले ॥
सरबं पाले ॥७८॥

रूआल छंद ॥ त्वप्रसादि ॥
आदि रूप अनादि मूरति अजोनि पुरख अपार ॥
सरब मान त्रिमान देव अभेव आदि उदार ॥
सरब पालक सरब घालक सरब को पुनि काल ॥
ज्त्र त्त्र बिराजही अवधूत रूप रिसाल ॥७९॥

नाम ठाम न जाति जाकर रूप रंग न रेख ॥
आदि पुरख उदार मूरति अजोनि आदि असेख ॥
देस अउर न भेस जाकर रूप रेख न राग ॥
जत्र तत्र दिसा विसा हुइ फैलिओ अनुराग ॥८०॥
      ''',
      pageNumber: 21,
    ),

    PathDetails(
      text: '''
नाम काम बिहीन पेखत धाम हूं नहि जाहि ॥
सरब मान सरब्त्र मान सदैव मानत ताहि ॥
एक मूरति अनेक दरसन कीन रूप अनेक ॥
खेल खेलि अखेल खेलन अंत को फिरि एक ॥८१॥

देव भेव न जानही जिह बेद अउर कतेब ॥
रूप रंग न जाति पाति सु जानई किह जेब ॥
तात मात न जात जाकर जनम मरन बिहीन ॥
च्क्र ब्क्र फिरै चतुर चकि मान ही पुर तीन ॥८२॥

लोक चउदह के बिखै जग जाप ही जिह जापु ॥
आदि देव अनादि मूरति थापिओ सबै जिह थापु ॥
परम रूप पुनीत मूरति पूरन पुरख अपार ॥
सरब बिस्व रचिओ सुय्मभव गड़न भंजनहार ॥८३॥
      ''',
      pageNumber: 22,
    ),

    PathDetails(
      text: '''
काल हीन कला संजुगति अकाल पुरख अदेस ॥
धरम धाम सु भरम रहत अभूत अलख अभेस ॥
अंग राग न रंग जा कहि जाति पाति न नाम ॥
गरब गंजन दुसट भंजन मुकति दाइक काम ॥८४॥

आप रूप अमीक अनउसतति एक पुरख अवधूत ॥
गरब गंजन सरब भंजन आदि रूप असूत ॥
अंह हीन अभंग अनातम एक पुरख अपार ॥
सरब लाइक सरब घाइक सरब को प्रतिपार ॥८५॥

सरब गंता सरब हंता सरब ते अनभेख ॥
सरब सासत्र न जानही जिह रूप रंगु अरु रेख ॥
परम बेद पुराण जाकहि नेति भाखत नित ॥
कोटि सिम्रित पुरान सासत्र न आवई वहु चि्त ॥८६॥
      ''',
      pageNumber: 23,
    ),

    PathDetails(
      text: '''
मधुभार छंद ॥ त्वप्रसादि ॥
गुन गन उदार ॥
महिमा अपार ॥
आसन अभंग ॥
उपमा अनंग ॥८७॥

अनभउ प्रकास ॥
निस दिन अनास ॥
आजानु बाहु ॥
साहानु साहु ॥८८॥

राजान राज ॥
भानान भान ॥
देवान देव ॥
उपमा महान ॥८९॥

इंद्रान इंद्र ॥
बालान बाल ॥
रंकान रंक ॥
कालान काल ॥९०॥
      ''',
      pageNumber: 24,
    ),

    PathDetails(
      text: '''
अनभूत अंग ॥
आभा अभंग ॥
गति मिति अपार ॥
गुन गन उदार ॥९१॥

मुनि गन प्रनाम ॥
निरभै निकाम ॥
अति दुति प्रचंड ॥
मित गति अखंड ॥९२॥

आलिस्य करम ॥
आद्रिस्य धरम ॥
सरबा भरणाढय ॥
अनडंड बाढय ॥९३॥

चाचरी छंद ॥ त्वप्रसादि ॥
गुबिंदे ॥
मुकंदे ॥
उदारे ॥
अपारे ॥९४॥
      ''',
      pageNumber: 25,
    ),

    PathDetails(
      text: '''
हरीअं ॥
करीअं ॥
न्रिनामे ॥
अकामे ॥९५॥

भुजंग प्रयात छंद ॥
च्त्र च्क्र करता ॥
च्त्र च्क्र हरता ॥
च्त्र च्क्र दाने ॥
च्त्र च्क्र जाने ॥९६॥

च्त्र च्क्र वरती ॥
च्त्र च्क्र भरती ॥
च्त्र च्क्र पाले ॥
च्त्र च्क्र काले ॥९७॥

च्त्र च्क्र पासे ॥
च्त्र च्क्र वासे ॥
च्त्र च्क्र मानयै ॥
च्त्र च्क्र दानयै ॥९८॥
      ''',
      pageNumber: 26,
    ),

    PathDetails(
      text: '''
चाचरी छंद ॥
न स्त्रै ॥
न मि्त्रै ॥
न भरमं ॥
न भि्त्रै ॥९९॥

न करमं ॥
न काए ॥
अजनमं ॥
अजाए ॥१००॥

न चि्त्रै ॥
न मि्त्रै ॥
परे हैं ॥
पवि्त्रै ॥१०१॥

प्रिथीसै ॥
अदीसै ॥
अद्रिसै ॥
अक्रिसै ॥१०२॥
      ''',
      pageNumber: 27,
    ),

    PathDetails(
      text: '''
भगवती छंद ॥ त्वप्रसादि कथते ॥
कि आछि्ज देसै ॥
कि आभि्ज भेसै ॥
कि आगंज करमै ॥
कि आभंज भरमै ॥१०३॥

कि आभिज लोकै ॥
कि आदित सोकै ॥
कि अवधूत बरनै ॥
कि बिभूत करनै ॥१०४॥

कि राजं प्रभा हैं ॥
कि धरमं धुजा हैं ॥
कि आसोक बरनै ॥
कि सरबा अभरनै ॥१०५॥

कि जगतं क्रिती हैं ॥
कि छत्रं छत्री हैं ॥
कि ब्रहमं सरूपै ॥
कि अनभउ अनूपै ॥१०६॥
      ''',
      pageNumber: 28,
    ),

    PathDetails(
      text: '''
कि आदि अदेव हैं ॥
कि आपि अभेव हैं ॥
कि चि्त्रं बिहीनै ॥
कि एकै अधीनै ॥१०७॥

कि रोजी रजाकै ॥
रहीमै रिहाकै ॥
कि पाक बिऐब हैं ॥
कि गैबुल ग़ैब हैं ॥१०८॥

कि अफवुल गुनाह हैं ॥
कि शाहान शाह हैं ॥
कि कारन कुनिंद हैं ॥
कि रोज़ी दिहिंद हैं ॥१०९॥

कि राज़क रहीम हैं ॥
कि करमं करीम हैं ॥
कि सरबं कली हैं ॥
कि सरबं दली हैं ॥११०॥
      ''',
      pageNumber: 29,
    ),

    PathDetails(
      text: '''
कि सरब्त्र मानियै ॥
कि सरब्त्र दानियै ॥
कि सरब्त्र गउनै ॥
कि सरब्त्र भउनै ॥१११॥

कि सरब्त्र देसै ॥
कि सरब्त्र भेसै ॥
कि सरब्त्र राजै ॥
कि सरब्त्र साजै ॥११२॥
कि सरब्त्र दीनै ॥
कि सरब्त्र लीनै ॥
कि सरब्त्र जाहो ॥
कि सरब्त्र भाहो ॥११३॥

कि सरब्त्र देसै ॥
कि सरब्त्र भेसै ॥
कि सरब्त्र कालै ॥
कि सरब्त्र पालै ॥११४॥
      ''',
      pageNumber: 30,
    ),

    PathDetails(
      text: '''
कि सरब्त्र हंता ॥
कि सरब्त्र गंता ॥
कि सरब्त्र भेखी ॥
कि सरब्त्र पेखी ॥११५॥

कि सरब्त्र काजै ॥
कि सरब्त्र राजै ॥
कि सरब्त्र सोखै ॥
कि सरब्त्र पोखै ॥११६॥

कि सरब्त्र त्राणै ॥
कि सरब्त्र प्राणै ॥
कि सरब्त्र देसै ॥
कि सरब्त्र भेसै ॥११७॥

कि सरब्त्र मानियैं ॥
सदैवं प्रधानियैं ॥
कि सरब्त्र जापियै ॥
कि सरब्त्र थापियै ॥११८॥
      ''',
      pageNumber: 31,
    ),

    PathDetails(
      text: '''
कि सरब्त्र भानै ॥
कि सरब्त्र मानै ॥
कि सरब्त्र इंद्रै ॥
कि सरब्त्र चंद्रै ॥११९॥

कि सरबं कलीमै ॥
कि परमं फ़हीमै ॥
कि आकिल अलामै ॥
कि साहिब कलामै ॥१२०॥

कि हुसनल वजू हैं ॥
तमामुल रुजू हैं ॥
हमेसुल सलामै ॥
सलीखत मुदामैं ॥१२१॥

ग़नीमुल शिकसतै ॥
गरीबुल परसतै ॥
बिलंदुल मकानै ॥
ज़मीनुल ज़मानै ॥१२२॥
      ''',
      pageNumber: 32,
    ),

    PathDetails(
      text: '''
तमीज़ुल तमामैं ॥
रुजूअल निधानैं ॥
हरीफ़ुल अजीमैं ॥
रज़ाइक यकीनै ॥१२३॥

अनेकुल तरंग हैं ॥
अभेद हैं अभंग हैं ॥
अज़ीज़ुल निवाज़ हैं ॥
ग़नीमुल खिराज हैं ॥१२४॥

निरुकत सरूप हैं ॥
त्रिमुकति बिभूत हैं ॥
प्रभुगति प्रभा हैं ॥
सुजुगति सुधा हैं ॥१२५॥

सदैवं सरूप हैं ॥
अभेदी अनूप हैं ॥
समसतो पराज हैं ॥
सदा सरब साज हैं ॥१२६॥
      ''',
      pageNumber: 33,
    ),

    PathDetails(
      text: '''
समसतुल सलाम हैं ॥
सदैवल अकाम हैं ॥
न्रिबाध सरूप हैं ॥
अगाध हैं अनूप हैं ॥१२७॥

ओअं आदि रूपे ॥
अनादि सरूपै ॥
अनंगी अनामे ॥
त्रिभंगी त्रिकामे ॥१२८॥

त्रिबरगं त्रिबाधे ॥
अगंजे अगाधे ॥
सुभं सरब भागे ॥
सु सरबा अनुरागे ॥१२९॥

त्रिभुगत सरूप हैं ॥
अछि्ज हैं अछूत हैं ॥
कि नरकं प्रणास हैं ॥
प्रिथीउल प्रवास हैं ॥१३०॥
      ''',
      pageNumber: 34,
    ),

    PathDetails(
      text: '''
निरुकति प्रभा हैं ॥
सदैवं सदा हैं ॥
बिभुगति सरूप है ॥
प्रजुगति अनूप हैं ॥१३१॥

निरुकति सदा हैं ॥
बिभुगति प्रभा हैं ॥
अनउकति सरूप हैं ॥
प्रजुगति अनूप हैं ॥१३२॥

चाचरी छंद ॥
अभंग हैं ॥
अनंग हैं ॥
अभेख हैं ॥
अलेख हैं ॥१३३॥

अभरम हैं ॥
अकरम हैं ॥
अनादि हैं ॥
जुगादि हैं ॥१३४॥
      ''',
      pageNumber: 35,
    ),

    PathDetails(
      text: '''
अजै हैं ॥
अबै हैं ॥
अभूत हैं ॥
अधूत हैं ॥१३५॥

अनास हैं ॥
उदास हैं ॥
अधंध हैं ॥
अबंध हैं ॥१३६॥

अभगत हैं ॥
बिरकत हैं ॥
अनास हैं ॥
प्रकास हैं ॥१३७॥

निचिंत हैं ॥
सुनिंत हैं ॥
अलि्ख हैं ॥
अदि्ख हैं ॥१३८॥
      ''',
      pageNumber: 36,
    ),

    PathDetails(
      text: '''
अलेख हैं ॥
अभेख हैं ॥
अढाह हैं ॥
अगाह हैं ॥१३९॥

अस्मभ हैं ॥
अग्मभ हैं ॥
अनील हैं ॥
अनादि हैं ॥१४०॥

अनित हैं ॥
सुनित हैं ॥
अजात हैं ॥
अजादि हैं ॥१४१॥

चरपट छंद ॥ त्वप्रसादि ॥
सरबं हंता ॥
सरब गंता ॥
सरबं खिआता ॥
सरबं गिआता ॥१४२॥
      ''',
      pageNumber: 37,
    ),

    PathDetails(
      text: '''
सरबं हरता ॥
सरबं करता ॥
सरबं प्राणं ॥
सरबं त्राणं ॥१४३॥

सरबं करमं ॥
सरबं धरमं ॥
सरबं जुगता ॥
सरबं मुकता ॥१४४॥

रसावल छंद ॥ त्वप्रसादि ॥
नमो नरक नासे ॥
सदैवं प्रकासे ॥
अनंगं सरूपे ॥
अभंगं बिभूते ॥१४५॥

प्रमाथं प्रमाथे ॥
सदा सरब साथे ॥
अगाध सरूपे ॥
न्रिबाध बिभूते ॥१४६॥
      ''',
      pageNumber: 38,
    ),

    PathDetails(
      text: '''
अनंगी अनामे ॥
त्रिभंगी त्रिकामे ॥
न्रिभंगी सरूपे ॥
सरबंगी अनूपे ॥१४७॥

न पोत्रै न पुत्रै ॥
न सत्रै न मित्रै ॥
न तातै न मातै ॥
न जातै न पातै ॥१४८॥

न्रिसाकं सरीक हैं ॥
अमितो अमीक हैं ॥
सदैवं प्रभा हैं ॥
अजै हैं अजा हैं ॥१४९॥
      ''',
      pageNumber: 39,
    ),

    PathDetails(
      text: '''
भगवती छंद ॥ त्वप्रसादि ॥
कि ज़ाहिर ज़हूर हैं ॥
कि हाज़िर हज़ूर हैं ॥
हमेसुल सलाम हैं ॥
समसतुल कलाम हैं ॥१५०॥

कि साहिब दिमाग हैं ॥
कि हुसनल चराग हैं ॥
कि कामल करीम हैं ॥
कि राज़क रहीम हैं ॥१५१॥

कि रोज़ी दिहिंद हैं ॥
कि राज़क रहिंद हैं ॥
करीमुल कमाल हैं ॥
कि हुसनल जमाल हैं ॥१५२॥
      ''',
      pageNumber: 40,
    ),

    PathDetails(
      text: '''
ग़नीमुल ख़िराज हैं ॥
ग़रीबुल निवाज़ हैं ॥
हरफ़िुल शिकंन हैं ॥
हिरासुल फिकंन हैं ॥१५३॥

कलंकं प्रणास हैं ॥
समसतुल निवास हैं ॥
अगंजुल गनीम हैं ॥
रजाइक रहीम हैं ॥१५४॥

समसतुल जुबां हैं ॥
कि साहिब किरां हैं ॥
कि नरकं प्रणास हैं ॥
बहिसतुल निवास हैं ॥१५५॥
      ''',
      pageNumber: 41,
    ),

    PathDetails(
      text: '''
कि सरबुल गवंन हैं ॥
हमेसुल रवंन हैं ॥
तमामुल तमीज हैं ॥
समसतुल अजीज हैं ॥१५६॥

परं परम ईस हैं ॥
समसतुल अदीस हैं ॥
अदेसुल अलेख हैं ॥
हमेसुल अभेख हैं ॥१५७॥

ज़मीनुल ज़मां हैं ॥
अमीकुल इमां हैं ॥
करीमुल कमाल हैं ॥
कि जुरअति जमाल हैं ॥१्हू५८॥
      ''',
      pageNumber: 42,
    ),

    PathDetails(
      text: '''
कि अचलं प्रकास हैं ॥
कि अमितो सुबास हैं ॥
कि अजब सरूप हैं ॥
कि अमितो बिभुूत हैं ॥१५९॥

कि अमितो पसा हैं ॥
कि आतम प्रभा हैं ॥
कि अचलं अनंग हैं ॥
कि अमितो अभंग हैं ॥१६०॥

मधुभार छंद ॥ त्वप्रसादि ॥
मुनि मनि प्रनाम ॥
गुनि गन मुदाम ॥
अरि बर अगंज ॥
हरि नर प्रभंज ॥१६१॥
      ''',
      pageNumber: 43,
    ),

    PathDetails(
      text: '''
अनगन प्रनाम ॥
मुनि मनि सलाम ॥
हरि नर अखंड ॥
बर नर अमंड ॥१६२॥

अनभव अनास ॥
मुनि मनि प्रकास ॥
गुनि गन प्रनाम ॥
जल थल मुदाम ॥१६३॥

अनिछ्ज अंग ॥
आसन अभंग ॥
उपमा अपार ॥
गति मिति उदार ॥१६४॥
      ''',
      pageNumber: 44,
    ),

    PathDetails(
      text: '''
जल थल अमंड ॥
दिस विस अभंड ॥
जल थल महंत ॥
दिस विस बिअंत ॥१६५॥

अनभव अनास ॥
ध्रित धर धुरास ॥
आजान बाहु ॥
एकै सदाहु ॥१६६॥

ओअंकार आदि ॥
कथनी अनादि ॥
खल खंड खिआल ॥
गुर बर अकाल ॥१६७॥
      ''',
      pageNumber: 45,
    ),

    PathDetails(
      text: '''
घर घरि प्रनाम ॥
चित चरन नाम ॥
अनिछ्ज गात ॥
आजिज न बात ॥१६८॥

अनझंझ गात ॥
अनरंज बात ॥
अनटुट तंडार ॥
अनठट अपार ॥१६९॥

आडीठ धरम ॥
अति ढीठ करम ॥
अणब्रण अनंत ॥
दाता महंत ॥१७०॥
      ''',
      pageNumber: 46,
    ),

    PathDetails(
      text: '''

हरि बोल मना छंद ॥ त्वप्रसादि ॥
करुणालय हैं ॥
अरि घालय हैं ॥
खल खंडन हैं ॥
महि मंडन हैं ॥१७१॥

जगतेस्वर हैं ॥
परमेस्वर हैं ॥
कलि कारण हैं ॥
सरब उबारण हैं ॥१७२॥

ध्रित के ध्रण हैं ॥
जग के क्रण हैं ॥
मन मानिय हैं ॥
जग जानिय हैं ॥१७३॥      
''',
      pageNumber: 47,
    ),

    PathDetails(
      text: '''
सरबं भर हैं ॥
सरबं कर हैं ॥
सरब पासिय हैं ॥
सरब नासिय हैं ॥१७४॥

करुणाकर हैं ॥
बिस्व्मभर हैं ॥
सरबेस्वर हैं ॥
जगतेस्वर हैं ॥१७५॥

ब्रहमंडस हैं ॥
खल खंडस हैं ॥
पर ते पर हैं ॥
करुणाकर हैं ॥१७६॥
      ''',
      pageNumber: 48,
    ),


    PathDetails(
      text: '''
अजपा जप हैं ॥
अथपा थप हैं ॥
अक्रिताक्रित हैं ॥
अम्रिताम्रित हैं ॥१७७॥

अम्रिताम्रित हैं ॥
करुणाक्रित हैं ॥
अक्रिताक्रत हैं ॥
धरणीध्रित हैं ॥१७८॥

अम्रितेस्वर हैं ॥
परमेस्वर हैं ॥
अक्रिताक्रित हैं ॥
अम्रिताम्रित हैं ॥१७९॥
      ''',
      pageNumber: 49,
    ),
    
    
    PathDetails(
      text: '''
अजबाक्रित हैं ॥
अम्रिताअम्रित हैं ॥
नर नाइक हैं ॥
खल घाइक हैं ॥१८०॥

बिस्व्मभर हैं ॥
करुणालय हैं ॥
न्रिप नाइक हैं ॥
सरब पाइक हैं ॥१८१॥

भव भंजन हैं ॥
अरि गंजन हैं ॥
रिपु तापन हैं ॥
जपु जापन हैं ॥१८२॥
      ''',
      pageNumber: 50,
    ),

    PathDetails(
      text: '''
अकलंक्रित हैं ॥
सरबाक्रित हैं ॥
करता कर हैं ॥
हरता हरि हैं ॥१८३॥

परमातम हैं ॥
सरबातम हैं ॥
आतम बस हैं ॥
जस के जस हैं ॥१८४॥

भुजंग प्रयात छंद ॥
नमो सूरज सुरजे नमो चंद्र चंद्रे ॥
नमो राज राजे नमो इंद्र इंद्रे ॥
नमो अंधकारे नमो तेज तेजे ॥
नमो ब्रिंद ब्रिंदे नमो बीज बीजे ॥१८५॥
      ''',
      pageNumber: 51,
    ),

    PathDetails(
      text: '''
नमो राजसं तामसं सांति रूपे ॥
नमो परम त्तं अततं सरूपे ॥
नमो जोग जोगे नमो गिआन गिआने ॥
नमो मंत्र मंत्रे नमो धिआन धिआने ॥१८६॥

नमो जुध जुधे नमो गिआन गिआने ॥
नमो भोज भोजे नमो पान पाने ॥
नमो कलह करता नमो सांति रूपे ॥
नमो इंद्र इंद्रे अनादं बिभूते ॥१८७॥

कलंकार रूपे अलंकार अलंके ॥
नमो आस आसे नमो बांक बंके ॥
अभंगी सरूपे अनंगी अनामे ॥
त्रिभंगी त्रिकाले अनंगी अकामे ॥१८८॥
      ''',
      pageNumber: 52,
    ),

    PathDetails(
      text: '''
एक अछरी छंद ॥
अजै ॥
अलै ॥
अभै ॥
अबै ॥१८९॥

अभू ॥
अजू ॥
अनास ॥
अकास ॥१९०॥

अगंज ॥
अभंज ॥
अलख ॥
अभख ॥१९१॥
      ''',
      pageNumber: 53,
    ),

    PathDetails(
      text: '''
अकाल ॥
दिआल ॥
अलेख ॥
अभेख ॥१९२॥

अनाम ॥
अकाम ॥
अगाह ॥
अढाह ॥१९३॥

अनाथे ॥
प्रमाथे ॥
अजोनी ॥
अमोनी ॥१९४॥
      ''',
      pageNumber: 54,
    ),

    PathDetails(
      text: '''
न रागे ॥
न रंगे ॥
न रूपे ॥
न रेखे ॥१९५॥

अकरमं ॥
अभरमं ॥
अगंजे ॥
अलेखे ॥१९६॥
      ''',
      pageNumber: 55,
    ),

    PathDetails(
      text: '''
भुजंग प्रयात छंद ॥
नमसतुल प्रणामे समसतुल प्रणासे ॥
अगंजुल अनामे समसतुल निवासे ॥
न्रिकामं बिभूते ॥ समसतुल सरूपे ॥
कुकरमं प्रणासी सुधरमं बिभूते ॥१९७॥

सदा स्चिदानंद स्त्रं प्रणासी ॥
करीमुल कुनिंदा समसतुल निवासी ॥
अजाइब बिभूते गजाइब गनीमे ॥
हरीअं करीअं करीमुल रहीमे ॥१९८॥

च्त्र च्क्र वरती च्त्र च्क्र भुगते ॥
सुय्मभव सुभं सरबदा सरब जुगते ॥
दुकालं प्रणासी दिआलं सरूपे ॥
सदा अंग संगे अभंगं बिभूते ॥१९९॥
      ''',
      pageNumber: 56,
    ),
  ];


  // The method created below called displayText is used to display the
  // text according to each page number
  String displayJaapSahibText(){
    // the below return statement is just for checking that the app is running
    // correctly or not
    // return _pageList[0].text;
    return _pageList[_checkPageNumber].text;
  }

  // the function below is used to increase the number of _checkPageNumber by 1
  void jaapSahibNextPageNumber(){
    if(_checkPageNumber < _pageList.length - 1){
      _checkPageNumber++;
    }
    // return _checkPageNumber;
    // the below print statement is just for debugging purpose
    // print(_checkPageNumber);

  }



  // the function below is used to decrease the number of _checkPageNumber by 1
  void jaapSahibPreviousPageNumber(){
    //  logic to go back to the previous page
    int newCheckPageNumber = _pageList[_checkPageNumber].pageNumber;

    _checkPageNumber = newCheckPageNumber;
    _checkPageNumber--;

    // the below line of code is just for debugging purpose
    // print('the page number is $_checkPageNumber');

    // the below line of code is just for the debugging purpose
    // print('previous page  number button pressed');
  }


  //  the function below displays the current page number
  int jaapSahibCurrentPageNumber(){
    return _pageList[_checkPageNumber].pageNumber;
  }

  // the function below reset the page number to 0
  void resetJaapSahibPages(){
    _checkPageNumber = 0;
  }


  // the function below is used to check if the user has reached the last page
  //  of the path or not
  bool isJaapSahibFinished(){
    if(_checkPageNumber > _pageList.length - 1){
      return true;
    } else {
      return false;
    }


  }


// the function below is used to check if the user is present on the first page
//  of the path or not
  bool jaapSahibFirstPageValue(){
    if(_checkPageNumber == 0){
      return true;
    } else {
      return false;
    }
  }


  // the function below is used to display the page number of current page
  String printCurrentPageValue(){
    int currentNumber = _pageList[_checkPageNumber].pageNumber;
    String displayCurrentPageNumber = currentNumber.toString();
    return displayCurrentPageNumber;
  }

  // the function below is used to print the previous page number
  String printPreviousPageValue(){
    String pageValue = printCurrentPageValue();
    // converting the value of String to int
    int intPageValue = int.parse(pageValue);

    int previousPageValue = intPageValue - 1;
    // the below line of code is for debugging purpose
    //print('the previous page value is: $previousPageValue');
    // returning the previous page value in the String format
    //return previousPageValue.toString();

    // condition to remove -1
    if(previousPageValue == -1){
      previousPageValue = 0;
      return previousPageValue.toString();
    } else {
      return previousPageValue.toString();
    }
  }

  // the function below is used to print the next page number
  String printNextPageNumber(){
    String pageValue = printCurrentPageValue();
    // converting the value of String to int
    int intPageValue = int.parse(pageValue);

    int nextPageValue = intPageValue + 1;
    // the below line of code is for debugging purpose
    //print('The next page value is: $nextPageValue');

    // returning the next page value in the String format
    // return nextPageValue.toString();

    if(nextPageValue == _pageList.length){
      nextPageValue = _pageList.length - 1;
      return nextPageValue.toString();
    } else {
      return nextPageValue.toString();
    }
  }

  // the function below is used to return the total pageNumbers present in the path
// in String format
  String totalPageNumbers(){
    int pageNumbers = _pageList.length - 1;
    return pageNumbers.toString();
  }

}